app/views/users/new.html.slim

      = f.input :password_confirmation
      = f.association :school, collection: School.order(:name)
---
SELECT "schools".* FROM "schools" ORDER BY "schools"."name" ASC