app/views/courses/_term_info.html.slim

		h3 Marks
		- current_user.marks.where(course_id: @course.id, purpose: purpose).each do |mark|
				.marks = mark.mark
	.col-xs-6
---
SELECT "marks".* FROM "marks" WHERE "marks"."user_id" = $1 AND "marks"."course_id" = $2 AND "marks"."purpose" = $3  [["user_id", 3], ["course_id", 1], ["purpose", 0]]

			li Excused
			= current_user.absences.where(course_id: @course.id, excused: true, purpose: purpose).sum("value")
---
SELECT SUM("absences"."value") FROM "absences" WHERE "absences"."user_id" = $1 AND "absences"."course_id" = $2 AND "absences"."excused" = $3 AND "absences"."purpose" = $4  [["user_id", 3], ["course_id", 1], ["excused", "t"], ["purpose", 0]]