app/views/courses/_term_marks.html.slim

SELECT "marks".* FROM "marks" WHERE "marks"."user_id" = $1 AND "marks"."course_id" = $2 AND "marks"."purpose" = $3  [["user_id", 3], ["course_id", 1], ["purpose", 0]]
---
- if current_user.student?
	- current_user.marks.where(course_id: @course.id, purpose: purpose).each do |mark|
		.marks = mark.mark