app/views/courses/index.html.slim

SELECT  "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "subjects".* FROM "subjects" WHERE "subjects"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "courses".* FROM "courses" WHERE "courses"."group_id" = $1 AND "courses"."grade" = $2  [["group_id", 1], ["grade", 10]]
---
  - @courses.each do |course|
  	= link_to "#{course.subject.name} #{course.grade}#{course.group.name}", root_url, class: "course col-xs-12 col-md-4"

SELECT "marks".* FROM "marks" WHERE "marks"."user_id" = $1 AND "marks"."course_id" = 1  [["user_id", 3]]
---
	        td.marks
						- current_user.marks.where(course_id: course_group.course).each do |mark|
						    	.received-mark.col-xs-1 = mark.mark