app/views/courses/index.html.slim

			- @courses.where(grade: klass).each do |course|
				= link_to "#{course.subject.name} #{course.grade}#{course.group.name}", school_course_path(course.school, course), class: "course col-xs-12 col-md-4"
---
SELECT  "schools".* FROM "schools" WHERE "schools"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]