app/views/courses/show.html.slim

h1
	= "#{@course.subject.name} #{@course.group.grade}#{@course.group.name}"
	.pull-right
---
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "subjects".* FROM "subjects" WHERE "subjects"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]