app/controllers/courses_controller.rb

SELECT  "courses".* FROM "courses" WHERE "courses"."user_id" = $1 ORDER BY "courses"."id" ASC LIMIT $2  [["user_id", 5], ["LIMIT", 1]]
SELECT  "groups".* FROM "groups" WHERE "groups"."user_id" = $1 LIMIT $2  [["user_id", 5], ["LIMIT", 1]]
---
  def index
    case current_user.role
    when 'teacher'
      @courses = current_user.courses
    when 'student'
      @courses = current_user.group.courses

SELECT  "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "groups".* FROM "groups" WHERE "groups"."user_id" = $1 LIMIT $2  [["user_id", 5], ["LIMIT", 1]]
---
  def show
    @students = @course.group.students
    @courses = current_user.group.courses if current_user.student?

SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_course
      @course = Course.find_by_id(params[:course_id]) || Course.find(params[:id])