app/controllers/course_groups_controller.rb

SELECT  "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "schools".* FROM "schools" WHERE "schools"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
  	@students = @course_group.group.students
  	@school = School.find(params[:school_id])

SELECT  "course_groups".* FROM "course_groups" WHERE "course_groups"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def set_course_group
  	@course_group = CourseGroup.find(params[:id])