app/controllers/groups_controller.rb

  def create
    @group = Group.new(group_params)

    respond_to do |format|
      if @group.save
---
INSERT INTO "groups" ("grade", "name", "school_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["grade", 5], ["name", "a"], ["school_id", 1], ["created_at", "2017-07-20 16:15:22.425606"], ["updated_at", "2017-07-20 16:15:22.425606"]]