app/controllers/marks_controller.rb

  def create
    @student = User.find(params[:user_id])
    @mark    = @student.marks.new(mark_params)
    @course  = Course.find(params[:mark][:course_id])

    respond_to do |format|
      if @mark.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "marks".* FROM "marks" WHERE "marks"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
INSERT INTO "marks" ("course_id", "user_id", "mark", "purpose", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["course_id", 1], ["user_id", 3], ["mark", 4], ["purpose", 1], ["created_at", "2017-08-21 12:38:17.024233"], ["updated_at", "2017-08-21 12:38:17.024233"]]