app/controllers/roles_controller.rb

INSERT INTO "roles" ("school_id", "title") VALUES ($1, $2) RETURNING "id"  [["school_id", 1], ["title", "Student"]]
---
  def create
    @role = Role.new(role_params)

    respond_to do |format|
      if @role.save