app/controllers/schools_controller.rb

  def create
    @school = School.new(school_params)

    respond_to do |format|
      if @school.save
---
INSERT INTO "schools" ("name", "address", "phone_number", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Софийска Математическа Гимназия"], ["address", "София"], ["phone_number", "359885955926"], ["created_at", "2017-07-20 15:06:46.488350"], ["updated_at", "2017-07-20 15:06:46.488350"]]

  def update
    respond_to do |format|
      if @school.update(school_params)
---
UPDATE "schools" SET "phone_number" = $1 WHERE "schools"."id" = $2  [["phone_number", "359885955926"], ["id", 4]]

  def destroy
    @school.destroy
---
DELETE FROM "schools" WHERE "schools"."id" = $1  [["id", 1]]