app/controllers/subjects_controller.rb

  def create
    @subject = Subject.new(subject_params)

    respond_to do |format|
      if @subject.save
---
INSERT INTO "subjects" ("name", "grade") VALUES ($1, $2) RETURNING "id"  [["name", "Български език и литература"], ["grade", 5]]