app/views/layouts/_sidebar.html.slim

SELECT  "groups".* FROM "groups" WHERE "groups"."user_id" = $1 LIMIT $2  [["user_id", 5], ["LIMIT", 1]]
SELECT  "schools".* FROM "schools" WHERE "schools"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
				span.col-xs-12 Alerts
			- if current_user.student? && current_user.group
				= link_to school_group_path(current_user.school, current_user.group), class: 'col-xs-6' do